Revit 2026 API

# ReferencePlaneGetReference Method

---

Returns the geometry reference of the reference plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetReference()
```
```vb
Public Function GetReference As Reference
```
```cpp
public:
Reference^ GetReference()
```
```fsharp
member GetReference : unit -> Reference
```

#### Return Value

Reference The geometry reference of the reference plane.

#### Reference

ReferencePlane Class

Autodesk.Revit.DB Namespace